[
    {
        "id": 1,
        "name": "Gillson Hall",
        "country": "1st-Year Residence Hall",
        "description": "Gillson Hall is only one of two residence halls on campus that are dedicated to first-year students. It was built in the 1960s as USF was undergoing a large transformative phase with numerous construction projects. It is currently dedicated to former USF Regent George Gillson, and since its opening, it has also become home to Counseling and Psychological Services (CAPS), which is accessible and free for all students. It is now a co-ed building, with females living on the first floor, males living on the second floor, and so on for its 8 floors. It is also able to house 400 residents with single, double, and triple rooms. ",
        "more": "Gillson Hall is on Golden Gate Avenue, and it is within walking distance to two of the city's largest bus routes. It is also adjacent to Hayes-Healy Hall and Memorial Gym, and it is a quick walk from University Center, which houses the cafeteria. It also includes WiFi, 24-hour desk service, one large student lounge, floor lounges, a laundry room, a kitchen, TVs in the lounges, foosball tables, and a piano.",
        "latitude": 37.7765,
        "longitude": -122.4489,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114792461-44eed200-9d3d-11eb-8094-25b076d303d8.jpg",
        "pictures": ["gillson", "gillson", "gillson", "gillson"],
        "advisory": "Residents and Guests over 18"
    },
    {
        "id": 2,
        "name": "Hayes-Healy Hall",
        "country": "1st-Year Residence Hall",
        "description": "Hayes-Healy is the other residence hall dedicated for first-year students. It was constructed just two years after Gillson Hall, and it was donated by Ramona Hayes-Healy and John Healy as a memorial to their parents. Originally, the building was only for female students, but it has become co-ed in a similar fashion to Gillson since 2003. The odd-number rooms have a beautiful view of Downtown San Francisco as well as the baseball field. ",
        "more": "Hayes-Healy Hall is able to house 400 students, but it is one floor taller than Gillson Hall. The building takes advantage of the extra space by adding an extra lounge and an entire floor dedicated to laundry. The university's USPS is also attached to the bottom of the residence hall. Hayes-Healy also includes 24-hour front desk service, WiFi throughout the building, a large kitchen, TVs in each lounge, a pool table, a ping pong table, and a piano.",
        "latitude": 37.7770,
        "longitude": -122.4487,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114792519-6485fa80-9d3d-11eb-9d73-f5b2c9770092.jpg",
        "pictures": ["HayesHealy"],
        "advisory": "Residents and Guests over 18"
    },
    {
        "id": 3,
        "name": "Benedetti Field",
        "country": "Baseball Field",
        "description": "Benedetti Field is home to the University of San Francisco Don's Baseball Team. It is a common event for students to spend their evenings watching baseball games, along with paying fans and families. The field is directly adjacent from a grocery store, Starbucks, 2 major bus routes, and Hayes-Healy Hall.",
        "more": "Benedetti Field sits on top of what was historically a Masonic cemetery. While under construction, the construction company had to stop work in order to remove the caskets, as they kept digging up bodies while working. Many people say this is one of the reasons USF is haunted, and you can supposedly hear ghosts while alone at night in Lone Mountain.",
        "latitude": 37.7769,
        "longitude": -122.4477,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114792584-7ebfd880-9d3d-11eb-87ea-71b5c513603a.jpg",
        "pictures": ["BaseballField"],
        "advisory": "Students or Paid Visitors"
    },
    {
        "id": 4,
        "name": "War Memorial Gym",
        "country": "Sports Gymnasium",
        "description": "War Memorial Gym, commonly known as The Hilltop, is where students and fans can watch Dons basketball and volleyball games. It is a tribute to a USF alumn who served in 3 wars overseas, and it currently seats 5,300 fans. USF is currently underway in expanding the gymnasium by creating a multi-use center for all students, and it will feature a USF Dons Hall of Fame. All games are free for students!",
        "more": "War Memorial Gym is directly across from the University Center, where students can find food before coming to see the games. It is also home to the city's only division one men's basketball team, and tickets for fans frequently sell out--especially when playing against the Zags.",
        "latitude": 37.7769,
        "longitude": -122.4495,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114792635-9303d580-9d3d-11eb-9bbf-c1d022084ba7.jpg",
        "pictures": ["WarMemorial"],
        "advisory": "Students, Athletes, and Paid Visitors"
    },
    {
        "id": 5,
        "name": "University Center",
        "country": "Student Areas",
        "description": "The University Center is the hub for student life at USF. It includes the bookstore, a coffee shop, a small convinience store, the main cafeteria, CASA (academic coaches) offices, the SF Foghorn (student newspaper), the Intecultural Center, Student Leadership and Engagement, USFtv, Career Services, Health Promotional Services, Housing and Residential Life, International Student Services, Public Safety, Student Org Offices, and more.",
        "more": "The University Center is commonly referred to as UC. It boasts 5 floors, making it one of the tallest buildings on campus. This is the place most students spend their time outside the classroom, as it includes offices, lounges, and more student amenities.",
        "latitude": 37.7766,
        "longitude": -122.4503,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114799928-956e2b80-9d4d-11eb-8a9a-61430f7c1edb.jpg",
        "pictures": ["UC"],
        "advisory": "Students and Visitors"
    },
    {
        "id": 6,
        "name": "McLaren",
        "country": "Conference Center",
        "description": "McLaren Conference Center is the location of USF's largest gathering rooms. It commonly hosts meetings, club fairs, job fests, conferences, interviews, and more.",
        "more": "If you apply to be a Resident Advisor in the residence halls, you will likely have your interview in this building! McLaren is also located at the bottom of Toler Hall across from the University Center",
        "latitude": 37.7760,
        "longitude": -122.4497,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114799999-b9317180-9d4d-11eb-9103-b6c73d98c2f4.jpg",
        "pictures": ["mcClaren"],
        "advisory": "Students and Visitors"
    },
    {
        "id": 7,
        "name": "Toler Hall",
        "country": "2nd-Year Residence Hall",
        "description": "Toler Hall was built in 1955. It also was--until 2021--the largest residence hall on campus. It houses 550 residents, including first-year students, continuing students, and transfer students. It is also the location of the university's first gender-inclusive housing floors. \n\nToler is located at the center of campus directly across from the Unviersity Center, and attached to Toler included Malloy Hall, McLaren Conference Center, and University Ministry. ",
        "more": "Toler was originally named Phelan Hall, after the former mayor of San Francisco. It was changed to Toler, however, after a group of students boycotted the name following the news that Phelan often made racist comments. Additionally, Toler originally housed the book store and dining room, which have both since moved to the UC. ",
        "latitude": 37.7761,
        "longitude": -122.4501,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114800047-cf3f3200-9d4d-11eb-9526-c1252ea725ca.jpg",
        "pictures": ["Toler"],
        "advisory": "Residents and Guests over 18"
    },
    {
        "id": 8,
        "name": "Malloy Hall",
        "country": "Business School",
        "description": "Malloy Hall is home to USF's School of Management, and it is the headquarters for both USF's undergraduate and graduate programs.",
        "more": "Malloy Hall was recently renovated to create more classrooms, faculty offices, computer labs, and study spaces. Also, if you ever want boba on camus, make sure to check out Malloy! You will often find different clubs selling boba for their fundraising efforts.",
        "latitude": 37.7756,
        "longitude": -122.4499,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114800211-204f2600-9d4e-11eb-82a1-16ef0a5a650b.jpg",
        "pictures": ["malloy"],
        "advisory": "Students"
    },
    {
        "id": 9,
        "name": "Kalmanovitz",
        "country": "Art and Social Sciences Building",
        "description": "Kalmanovitz, commonly known as K-Hall, is one of the largest buildings on campus. It includes classrooms and offices for art classes, foreign language classes, social studies classes, and more. There are also study spaces on every floor, and it is decorated with historical art throughout the building. K-Hall is also the oldest building on the main campus, as it was the first building USF built after the 1906 Earthquake which destroyed all of USF.",
        "more": "For a space on campus away from the rush, be sure to visit the third floor rooftop, where you will find a featured outdoor sculpture terrace with varying exhibits. Outside the main entrance is the K-Hall Amphitheater which houses a Renaissance-era church portal from the Spanish monastery. Around the amphitheater also includes heated seats so students can enjoy performances, even in the foggy weather of San Francisco.",
        "latitude": 37.7756,
        "longitude": -122.4510,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114800254-39f06d80-9d4e-11eb-9482-a813ac5db73a.jpg",
        "pictures": ["kalminovitz"],
        "advisory": "Students"
    },
    {
        "id": 10,
        "name": "Cowell Hall",
        "country": "Nursing Department",
        "description": "Cowell Hall is located in the ceneter of USF's lower campus, and it is the location of School of Nursing and Health professions. It includes a nursing simulation lab, offices, classrooms, and study areas. KUSF, the student-run radio station and a media lab are also located in Cowell.",
        "more": "Cowell is another of USF's oldest buildings, and it is connected to Kalmanovitz Hall. It also sits directly across from Lo Schiavo.",
        "latitude": 37.7760,
        "longitude": -122.4507,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114786587-369bb880-9d33-11eb-8fb4-2fdad0748895.jpg",
        "pictures": ["cowell"],
        "advisory": "Students"
    },
    {
        "id": 11,
        "name": "Lo Schiavo",
        "country": "Science Building",
        "description": "Lo Schiavo science center is in the center of campus, and it features a new state-of-the-art architecture. It's full name is the John Lo Schiavo, S.J. Cener for Science and Innovation, and it has revolutionized the way USF teaches math and science. It is 57,000 square feet, and it includes labs and classrooms for biology, physics, chemistry, environmental science, computer science, and more. There are also lounges on each floor which large white boards and modern seating and lighting.",
        "more": "Lo Schiavo is a smart building; it senses the weather and interior climate, and it opens and closes the windows/blinds accordingly--all automatically. There is also an atrium, plaza, and living roof for students to enjoy the sun while studying.",
        "latitude": 37.7762,
        "longitude": -122.4510,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114791432-6a7adc00-9d3b-11eb-8102-b566a9d0fc88.jpg",
        "pictures": ["LoSchiavo"],
        "advisory": "Students"
    },
    {
        "id": 12,
        "name": "Negoesco Stadium",
        "country": "Soccer Stadium",
        "description": "Negoesco Stadium is the primary location for USF's soccer games. It features stands and a concession stand, as well as stunning views of the sunset.",
        "more": "The soccer field is connected to USF's Koret Gymnasium, which has the largest indoor swimming pool in the entire city!",
        "latitude": 37.7764,
        "longitude": -122.4539,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114800344-673d1b80-9d4e-11eb-9b68-97ef54819b9e.jpg",
        "pictures": ["soccerField"],
        "advisory": "Students and Paid Visitors"
    },
    {
        "id": 13,
        "name": "Harney Science Center",
        "country": "Science Department",
        "description": "Harney includes science labs, faculty offices, interactive classrooms, and more! It is also home to the Dean's Office for the College of Arts and Sciences, the Computer Science Department, the Environmental Science Department, the Environmental Studies Department, the Chemistry Department, and the Biology Department.",
        "more": "Harney is one the oldest science building on campus, but it is currently undergoing rennovations for the newly established engineering program! Coming to Harney includes the Hive on the first floor, which will house a 3D Printer, state-of-the-art engineering tools, and more! Harney is also attached to Lo Schiavo.",
        "latitude": 37.7768,
        "longitude": -122.4512,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114800397-7f149f80-9d4e-11eb-9b08-b48fdc439fb3.jpg",
        "pictures": ["harney"],
        "advisory": "Students"
    },
    {
        "id": 14,
        "name": "Gleeson Library",
        "country": "Undergraduate Library",
        "description": "This is the library for all USF students. It features an expansive 13,000 volumes per year, a collection of digital resources, and over 90 employees! There are study rooms throughout the entire building, and each floor has a dedicated limit to volume, ranging from complete silence to no restrictions.",
        "more": "Gleeson Library also houses a rotatating art exhibit, a Rare Books collection room, and over 5,000 square feet of open space for quiet study.",
        "latitude": 37.7765,
        "longitude": -122.4520,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114800432-93f13300-9d4e-11eb-9c73-b93fb216680e.jpg",
        "pictures": ["gleeson"],
        "advisory": "Students"
    },
    {
        "id": 15,
        "name": "Gleeson Plaza",
        "country": "University Plaza",
        "description": "This plaza is one of the centers to campus that nearly every student will become familiar with. It is a common relaxation spot on nice days, and it hosts fun events throughout the year.",
        "more": "If you walk by on a weekend, you might mistake the plaza for a dog park! People from all over the neighborhood often bring their dogs to visit and play in the grass.",
        "latitude": 37.7756,
        "longitude": -122.4518,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114800468-a4a1a900-9d4e-11eb-95ca-636ffead02fb.jpg",
        "pictures": ["plaza"],
        "advisory": "Students and all Visitors"
    },
    {
        "id": 16,
        "name": "St. Ignatius Church",
        "country": "University Church",
        "description": "Saint Ignatius Church has existed since 1914--over 100 years! It offers social outreach opportunities, ministry programs, and a student Mass every Sunday at 7:00pm PST. It also welcomes the community for Mass everyday of the week at varying times.",
        "more": "After the 1906 earthquake, the original location of USF was completely destroyed. After digging through the rubble, however, they discovered the original church bell remained intact. They salvaged the bell, and that is the same church bell students can hear ringing every day at the top of each hour, and it is the only remanent of USF's original campus.",
        "latitude": 37.7756,
        "longitude": -122.4525,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114800504-b2572e80-9d4e-11eb-84cd-7ff991100651.jpg",
        "pictures": ["stIggy"],
        "advisory": "Students and all Churchgoers"
    },
    {
        "id": 17,
        "name": "Fromm Hall",
        "country": "All-Female Residence Hall",
        "description": "Fromm Hall is a residence hall for primarily first-year students. It is an all-female building to support USF's 60:40 female-to-male aspect ratio. Fromm was renovated in 2003, and it is directly across from St. Ignatius and Gleeson Library. The building houses 200 students, includes 5 floors, and has 3 lounges. It is also home to a chapel, the Fromm Institute for Lifelong Learning, and a conference center.",
        "more": "On the west side, residents have a beautiful view of Golden Gate Park (which is 20% larger than New York's Central Park!) and the Pacific Ocean.",
        "latitude": 37.7763,
        "longitude": -122.4527,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114800544-c438d180-9d4e-11eb-9544-743c070e4b99.jpg",
        "pictures": ["fromm"],
        "advisory": "Students, Guests above 18, and event attendees"
    },
    {
        "id": 18,
        "name": "XARTS",
        "country": "Art Studio",
        "description": "The full name to XARTS is The Development of Art + Architecture, and it is home to three architecture studios and classrooms, two computer labs, two fine art classrooms, and unique walls displaying students' art. ",
        "more": "The studio includes a wide range of media, from frawing, printmaking, digital fabrication, and more! It is designed to allow the students to experience as much hands-on work as possible.",
        "latitude": 37.7767,
        "longitude": -122.4529,
        "heroPicture": "https://user-images.githubusercontent.com/61028954/114800594-d7e43800-9d4e-11eb-84f3-a5c1ac71b811.jpg",
        "pictures": ["xArts"],
        "advisory": "Students"
    },
]
